
using UnityEngine;


///////////////////////////////////////////////////////////////////////////////
// motion ID 
///////////////////////////////////////////////////////////////////////////////

public enum MotionID {

    // 休闲待机	001
    // 	
    // 跑步	011
    // 走路	021
    // 翻滚	031
    // 	
    // 普通攻击1	101
    // 普通攻击2	102
    // 普通攻击3	103
    // 普通攻击4	104
    // 	
    // 受击站立	501
    // 倒地	502
    // 	
    // 死亡	504
    // 更换武器	601
    // 	
    // 	
    // 减速	701
    // 定身	702
    // 眩晕	703
    // 沉默	704
    // 睡眠	705
    // 	
    // 跳跃攻击	1001
    // 蓄力攻击	1002
    // 抓取突进	1101
    // 抓取攻击	1102
    // 抓取松手	1103
    // 	
    // 技能释放准备1	2001
    // 技能释放准备2	2002
    // 	
    // 技能攻击1	2101
    // 技能攻击2	2102
    // 技能攻击3	2103
    // 技能攻击4	2104


}

public enum WeaponID {



}


